In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn

<ol>
    <li>When we created numpy array we pass data</li>
</ol>

In [3]:
np.random.seed(101)
data = randn(5,4)
data

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [4]:
index = ['A', 'B', 'C', 'D', 'E']
columns = ['W', 'X', 'Y', 'Z']

In [6]:
mydataframe = pd.DataFrame (data, index, columns)
mydataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
mydataframe.to_excel ('dummy-data.xlsx')

In [10]:
myfirstdataframe = pd.read_excel('dummy-data.xlsx')
myfirstdataframe

  Unnamed: 0         W         X         Y         Z
0          A  2.706850  0.628133  0.907969  0.503826
1          B  0.651118 -0.319318 -0.848077  0.605965
2          C -2.018168  0.740122  0.528813 -0.589001
3          D  0.188695 -0.758872 -0.933237  0.955057
4          E  0.190794  1.978757  2.605967  0.683509

### Selection and Indexing

In [11]:
# Select a column

mydataframe['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
mydataframe[['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [13]:
mydataframe[['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [14]:
mydataframe['total'] = mydataframe['W'] + mydataframe['X'] + mydataframe['Y'] + mydataframe['Z']
mydataframe

          W         X         Y         Z     total
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

In [20]:
mydataframe.drop('total', axis = 1, inplace = True, errors = 'ignore') 

# use inplace = True to make it permanent
# no error will apper can be dangerous  ----- (errors = 'ignore')

In [18]:
mydataframe

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
# SERIES
# mydataframe['A'] cannot be used

mydataframe.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [23]:
mydataframe.loc[['A','C','E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# DATAFRAME

mydataframe.loc[['A']]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [25]:
mydataframe.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [26]:
mydataframe.iloc[[0,2,4]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [27]:
mydataframe.iloc[[0]]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [28]:
mydataframe.iloc[1:4]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
mydataframe.drop('total', axis = 0, inplace = True, errors = 'ignore')
mydataframe.loc['total'] = mydataframe.sum()
mydataframe

              W         X         Y         Z
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
C     -2.018168  0.740122  0.528813 -0.589001
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509
total  1.719289  2.268822  2.261436  2.159356

### Conditional Selection

In [33]:
mydataframe > 0

           W      X      Y      Z
A       True   True   True   True
B       True  False  False   True
C      False   True   True  False
D       True  False  False   True
E       True   True   True   True
total   True   True   True   True

In [34]:
mydataframe[mydataframe > 0]

              W         X         Y         Z
A      2.706850  0.628133  0.907969  0.503826
B      0.651118       NaN       NaN  0.605965
C           NaN  0.740122  0.528813       NaN
D      0.188695       NaN       NaN  0.955057
E      0.190794  1.978757  2.605967  0.683509
total  1.719289  2.268822  2.261436  2.159356

In [35]:
mydataframe[mydataframe['W'] > 0]

              W         X         Y         Z
A      2.706850  0.628133  0.907969  0.503826
B      0.651118 -0.319318 -0.848077  0.605965
D      0.188695 -0.758872 -0.933237  0.955057
E      0.190794  1.978757  2.605967  0.683509
total  1.719289  2.268822  2.261436  2.159356

In [37]:
mydataframe[(mydataframe['W'] > 0) & (mydataframe['Y'] > 0)]

              W         X         Y         Z
A      2.706850  0.628133  0.907969  0.503826
E      0.190794  1.978757  2.605967  0.683509
total  1.719289  2.268822  2.261436  2.159356

In [39]:
mydataframe[(mydataframe['W'] > 0) & (mydataframe['Y'] > 0)][['X','Z']]

              X         Z
A      0.628133  0.503826
E      1.978757  0.683509
total  2.268822  2.159356

In [41]:
for index, value in mydataframe.iterrows():
    print(index)
    w,x,y,z = value
    print (w,x,y,z)

A
2.706849839399938 0.6281327087844596 0.9079694464765431 0.5038257538223936
B
0.6511179479432686 -0.31931804459303326 -0.8480769834036315 0.6059653494949336
C
-2.018168244037392 0.7401220570561068 0.5288134940893595 -0.5890005332865824
D
0.18869530944922425 -0.758872056210466 -0.9332372163009188 0.9550565092637361
E
0.19079432237171562 1.9787573241128278 2.60596727979128 0.6835088855389145
total
1.7192891751267547 2.268821989149895 2.2614360206526323 2.159355964833395

### Creating our own indexes

In [44]:
mydataframe.drop('total', axis = 0, inplace = True)
mydataframe

KeyError: "['total'] not found in axis"

In [45]:
mydataframe.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [46]:
newindex_column = ['Selangor', 'Perak', 'Penang', 'Kedah', 'Johor']
newindex_column

['Selangor', 'Perak', 'Penang', 'Kedah', 'Johor']

In [47]:
mydataframe['state'] = newindex_column
mydataframe

          W         X         Y         Z     state
A  2.706850  0.628133  0.907969  0.503826  Selangor
B  0.651118 -0.319318 -0.848077  0.605965     Perak
C -2.018168  0.740122  0.528813 -0.589001    Penang
D  0.188695 -0.758872 -0.933237  0.955057     Kedah
E  0.190794  1.978757  2.605967  0.683509     Johor

In [49]:
mydataframe.set_index('state', inplace = True)
mydataframe

                 W         X         Y         Z
state
Selangor  2.706850  0.628133  0.907969  0.503826
Perak     0.651118 -0.319318 -0.848077  0.605965
Penang   -2.018168  0.740122  0.528813 -0.589001
Kedah     0.188695 -0.758872 -0.933237  0.955057
Johor     0.190794  1.978757  2.605967  0.683509

In [50]:
mydataframe.loc[['Selangor', 'Kedah']]

                 W         X         Y         Z
state
Selangor  2.706850  0.628133  0.907969  0.503826
Kedah     0.188695 -0.758872 -0.933237  0.955057

In [52]:
outside_index = ['G1','G1','G1','G2','G2','G2']
inner_index = [1,2,3,1,2,3]
new_index = list(zip(outside_index, inner_index))

multi_index = pd.MultiIndex.from_tuples(new_index)
multi_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
our_dataframe = pd.DataFrame(randn(6,2), multi_index, ['A','B'])
our_dataframe

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [54]:
our_dataframe.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [56]:
our_dataframe.loc['G2'].loc[[1,3]]

          A         B
1  0.166905  0.184502
3  0.638787  0.329646